Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.141/PIC32CK-SG01/atdf/PIC32CK2051SG01064.atdf
      <value-group name="XOSCCTRLA__CFDPRESC">
        <value name="DIV1" caption="48 MHz" value="0"/>
        <value name="DIV2" caption="24 MHz" value="1"/>
        <value name="DIV4" caption="12 MHz" value="2"/>
        <value name="DIV8" caption="6 MHz" value="3"/>
        <value name="DIV16" caption="3 MHz" value="4"/>
        <value name="DIV32" caption="1.5 MHz" value="5"/>
        <value name="DIV64" caption="0.75 MHz" value="6"/>
        <value name="DIV128" caption="0.3125 MHz" value="7"/>
      </value-group>
      <value-group name="XOSCCTRLA__USBHSDIV">
        <value name="DIS" caption="USBHS PLL reference XOSC clock is disabled" value="0x0"/>
        <value name="DIV1" caption="USBHS PLL reference XOSC clock is divided by 1" value="0x1"/>
        <value name="DIV2" caption="USBHS PLL reference XOSC clock is divided by 2" value="0x2"/>
        <value name="DIV3" caption="USBHS PLL reference XOSC clock is divided by 4" value="0x3"/>
      </value-group>
      <value-group name="PLL0CTRL__REFSEL">
        <value name="GCLK" caption="Dedicated GCLK clock reference" value="0x0"/>
        <value name="XOSC" caption="XOSC clock reference" value="0x1"/>
        <value name="DFLL48M" caption="DFLL48M clock reference" value="0x2"/>
      </value-group>
      <value-group name="PLL0CTRL__BWSEL">
        <value name="BWSEL0" caption="TBD" value="0x0"/>
        <value name="BWSEL1" caption="TBD" value="0x1"/>
        <value name="BWSEL2" caption="TBD" value="0x2"/>
        <value name="BWSEL3" caption="TBD" value="0x3"/>
        <value name="BWSEL4" caption="TBD" value="0x4"/>
        <value name="BWSEL5" caption="TBD" value="0x5"/>
        <value name="BWSEL6" caption="TBD" value="0x6"/>
        <value name="BWSEL7" caption="TBD" value="0x7"/>
      </value-group>
    </module>
    <module name="PAC" id="03585" name2="sec_pac_u2120_v2" version="2b0" caption="Peripheral Access Controller">
      <register-group name="PAC" caption="Peripheral Access Controller">
        <register name="WRCTRL" offset="0x0" rw="RW" size="4" initval="0x00000000" caption="Write control">
          <bitfield name="PERID" caption="Peripheral identifier" mask="0xFFFF"/>
          <bitfield name="KEY" caption="Peripheral access control key" mask="0xFF0000" values="WRCTRL__KEY"/>
        </register>
        <register name="EVCTRL" offset="0x4" rw="RW" size="1" initval="0x00" caption="Event control">
          <bitfield name="ERREO" caption="Peripheral acess error event output" mask="0x1"/>
        </register>
        <register name="INTENCLR" offset="0x8" rw="RW" size="1" atomic-op="clear:INTENCLR" initval="0x00" caption="Interrupt enable clear">
          <bitfield name="ERR" caption="Peripheral access error interrupt disable" mask="0x1"/>
        </register>
        <register name="INTENSET" offset="0x9" rw="RW" size="1" atomic-op="set:INTENSET" initval="0x00" caption="Interrupt enable set">
          <bitfield name="ERR" caption="Peripheral access error interrupt enable" mask="0x1"/>
        </register>
        <register name="INTFLAGAHB" offset="0x10" rw="RW" size="4" atomic-op="clear:INTFLAGAHB" initval="0x00000000" caption="Bridge interrupt flag status">
        </register>
        <register name="INTFLAGA" offset="0x14" rw="RW" size="4" atomic-op="clear:INTFLAGA" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge A">
        </register>
        <register name="INTFLAGB" offset="0x18" rw="RW" size="4" atomic-op="clear:INTFLAGB" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge B">
        </register>
        <register name="INTFLAGC" offset="0x1C" rw="RW" size="4" atomic-op="clear:INTFLAGC" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge C">
        </register>
        <register name="INTFLAGD" offset="0x20" rw="RW" size="4" atomic-op="clear:INTFLAGD" initval="0x00000000" caption="Peripheral interrupt flag status - Bridge D">
        </register>
        <register name="STATUSA" offset="0x34" rw="R" size="4" initval="0x000F0000" caption="Peripheral write protection status - Bridge A">
        </register>
        <register name="STATUSB" offset="0x38" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge B">
        </register>
        <register name="STATUSC" offset="0x3C" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge C">
        </register>
        <register name="STATUSD" offset="0x40" rw="R" size="4" initval="0x00000000" caption="Peripheral write protection status - Bridge D">
        </register>
        <register name="NONSECA" offset="0x54" rw="R" size="4" initval="0x00000000" caption="Peripheral Non-Secure Status - Bridge A">
        </register>
        <register name="NONSECB" offset="0x58" rw="R" size="4" initval="0x00000000" caption="Peripheral Non-Secure Status - Bridge B">
        </register>
        <register name="NONSECC" offset="0x5C" rw="R" size="4" initval="0x00000000" caption="Peripheral Non-Secure Status - Bridge C">
        </register>
        <register name="NONSECD" offset="0x60" rw="R" size="4" initval="0x00000000" caption="Peripheral Non-Secure Status - Bridge D">
        </register>
        <register name="SECLOCKA" offset="0x74" rw="R" size="4" initval="0x00000000" caption="Peripheral Security Lock Status - Bridge A">
        </register>
        <register name="SECLOCKB" offset="0x78" rw="R" size="4" initval="0x00000000" caption="Peripheral Security Lock Status - Bridge B">
        </register>
        <register name="SECLOCKC" offset="0x7C" rw="R" size="4" initval="0x00000000" caption="Peripheral Security Lock Status - Bridge C">
        </register>
        <register name="SECLOCKD" offset="0x80" rw="R" size="4" initval="0x00000000" caption="Peripheral Security Lock Status - Bridge D">
        </register>
      </register-group>
      <value-group name="WRCTRL__KEY">
        <value name="OFF" caption="No action" value="0"/>
        <value name="CLR" caption="Clear protection" value="1"/>
        <value name="SET" caption="Set protection" value="2"/>
        <value name="SETLCK" caption="Set and lock protection" value="3"/>
      </value-group>
    </module>
    <module name="PCC" id="03711" name2="ppi_pcc_u2017_v1" version="1c0" caption="Parallel Capture Controller">
      <register-group name="PCC" caption="Parallel Capture Controller">
        <register name="MR" offset="0x0" rw="RW" size="4" access-size="4" initval="0x00000000" caption="Mode Register">
          <bitfield name="PCEN" caption="Parallel Capture Enable" mask="0x1"/>
          <bitfield name="DSIZE" caption="Data size" mask="0x30"/>
          <bitfield name="SCALE" caption="Scale data" mask="0x100"/>
          <bitfield name="ALWYS" caption="Always Sampling" mask="0x200"/>
          <bitfield name="HALFS" caption="Half Sampling" mask="0x400"/>
          <bitfield name="FRSTS" caption="First sample" mask="0x800"/>
          <bitfield name="ISIZE" caption="Input Data Size" mask="0x70000"/>
          <bitfield name="CID" caption="Clear If Disabled" mask="0xC0000000"/>
        </register>
        <register name="IER" offset="0x4" rw="W" size="4" access-size="4" atomic-op="set:IMR" initval="0x00000000" caption="Interrupt Enable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Enable" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Enable" mask="0x2"/>
        </register>
        <register name="IDR" offset="0x8" rw="W" size="4" access-size="4" atomic-op="clear:IMR" initval="0x00000000" caption="Interrupt Disable Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Disable" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Disable" mask="0x2"/>
        </register>
        <register name="IMR" offset="0xC" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Mask Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Mask" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Mask" mask="0x2"/>
        </register>
        <register name="ISR" offset="0x10" rw="R" size="4" access-size="4" initval="0x00000000" caption="Interrupt Status Register">
          <bitfield name="DRDY" caption="Data Ready Interrupt Status" mask="0x1"/>
          <bitfield name="OVRE" caption="Overrun Error Interrupt Status" mask="0x2"/>
        </register>
        <register name="RHR" offset="0x14" rw="R" size="4" access-size="4" initval="0x00000000" caption="Reception Holding Register">
          <bitfield name="RDATA" caption="Reception Data" mask="0xFFFFFFFF"/>
        </register>
